# GraphicDisplayOptionsSketchyLines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GraphicDisplayOptionsSketchyLines Property
ParameterTypeId Class See Also
---
"Sketchy Lines"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GraphicDisplayOptionsSketchyLines { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GraphicDisplayOptionsSketchyLines As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GraphicDisplayOptionsSketchyLines {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace